# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..IsValid Method
IFCExtrusionData Class See Also
---
Determines if the extrusion data represents a valid extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the extrusion is valid, false otherwise.
# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace